name: "AlexNet-Teacher VGG16-Student"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 224
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
  data_param {
    source: "/home/ubuntu/caffe/examples/imagenet/ilsvrc12_train_lmdb"
    batch_size: 16
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: true
    crop_size: 224
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
  data_param {
    source: "/home/ubuntu/caffe/examples/imagenet/ilsvrc12_val_lmdb"
    batch_size: 75
    backend: LMDB
  }
}
layer {
  bottom: "data"
  top: "conv_st_1_1"
  name: "conv_st_1_1"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  bottom: "conv_st_1_1"
  top: "conv_st_1_1"
  name: "relu_st_1_1"
  type: "ReLU"
}
layer {
  bottom: "conv_st_1_1"
  top: "conv_st_1_2"
  name: "conv_st_1_2"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  bottom: "conv_st_1_2"
  top: "conv_st_1_2"
  name: "relu_st_1_2"
  type: "ReLU"
}
layer {
  bottom: "conv_st_1_2"
  top: "pool_st_1"
  name: "pool_st_1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool_st_1"
  top: "conv_st_2_1"
  name: "conv_st_2_1"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  bottom: "conv_st_2_1"
  top: "conv_st_2_1"
  name: "relu_st_2_1"
  type: "ReLU"
}
layer {
  bottom: "conv_st_2_1"
  top: "conv_st_2_2"
  name: "conv_st_2_2"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  bottom: "conv_st_2_2"
  top: "conv_st_2_2"
  name: "relu_st_2_2"
  type: "ReLU"
}
layer {
  bottom: "conv_st_2_2"
  top: "pool_st_2"
  name: "pool_st_2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool_st_2"
  top: "conv_st_3_1"
  name: "conv_st_3_1"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  bottom: "conv_st_3_1"
  top: "conv_st_3_1"
  name: "relu_st_3_1"
  type: "ReLU"
}
layer {
  bottom: "conv_st_3_1"
  top: "conv_st_3_2"
  name: "conv_st_3_2"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  bottom: "conv_st_3_2"
  top: "conv_st_3_2"
  name: "relu_st_3_2"
  type: "ReLU"
}
layer {
  bottom: "conv_st_3_2"
  top: "conv_st_3_3"
  name: "conv_st_3_3"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  bottom: "conv_st_3_3"
  top: "conv_st_3_3"
  name: "relu_st_3_3"
  type: "ReLU"
}
layer {
  bottom: "conv_st_3_3"
  top: "pool_st_3"
  name: "pool_st_3"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool_st_3"
  top: "conv_st_4_1"
  name: "conv_st_4_1"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  bottom: "conv_st_4_1"
  top: "conv_st_4_1"
  name: "relu_st_4_1"
  type: "ReLU"
}
layer {
  bottom: "conv_st_4_1"
  top: "conv_st_4_2"
  name: "conv_st_4_2"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  bottom: "conv_st_4_2"
  top: "conv_st_4_2"
  name: "relu_st_4_2"
  type: "ReLU"
}
layer {
  bottom: "conv_st_4_2"
  top: "conv_st_4_3"
  name: "conv_st_4_3"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  bottom: "conv_st_4_3"
  top: "conv_st_4_3"
  name: "relu_st_4_3"
  type: "ReLU"
}
layer {
  bottom: "conv_st_4_3"
  top: "pool_st_4"
  name: "pool_st_4"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool_st_4"
  top: "conv_st_5_1"
  name: "conv_st_5_1"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  bottom: "conv_st_5_1"
  top: "conv_st_5_1"
  name: "relu_st_5_1"
  type: "ReLU"
}
layer {
  bottom: "conv_st_5_1"
  top: "conv_st_5_2"
  name: "conv_st_5_2"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  bottom: "conv_st_5_2"
  top: "conv_st_5_2"
  name: "relu_st_5_2"
  type: "ReLU"
}
layer {
  bottom: "conv_st_5_2"
  top: "conv_st_5_3"
  name: "conv_st_5_3"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  bottom: "conv_st_5_3"
  top: "conv_st_5_3"
  name: "relu_st_5_3"
  type: "ReLU"
}
layer {
  bottom: "conv_st_5_3"
  top: "pool_st_5"
  name: "pool_st_5"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool_st_5"
  top: "fc_st_6"
  name: "fc_st_6"
  type: "InnerProduct"
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "xavier"
      }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  bottom: "fc_st_6"
  top: "fc_st_6"
  name: "relu_st_6"
  type: "ReLU"
}
layer {
  bottom: "fc_st_6"
  top: "fc_st_7"
  name: "fc_st_7"
  type: "InnerProduct"
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "xavier"
      }
    bias_filler {
      type: "constant"
      value: 0
    }
    }
}
layer {
  bottom: "fc_st_7"
  top: "fc_st_7"
  name: "relu_st_7"
  type: "ReLU"
}
layer {
  bottom: "fc_st_7"
  top: "fc_st_8"
  name: "fc_st_8"
  type: "InnerProduct"
  inner_product_param {
    num_output: 1000
    weight_filler {
      type: "xavier"
      }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "fc_st_8"
  bottom: "label"
  top: "loss"
}
layer {
  name: "accuracy/top1"
  type: "Accuracy"
  bottom: "fc_st_8"
  bottom: "label"
  top: "accuracy@1"
  accuracy_param {
    top_k: 1
  }
  include: {
    phase: TEST
  }
}
layer {
  name: "accuracy/top5"
  type: "Accuracy"
  bottom: "fc_st_8"
  bottom: "label"
  top: "accuracy@5"
  accuracy_param {
    top_k: 5
  }
  include: {
    phase: TEST
  }
}
